app/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:efc="http://foundation.rccl.com/v1/efcutil">
    <soapenv:Header/>
    <soapenv:Body>
        <efc:getAllPropertyNames/>
    </soapenv:Body>
</soapenv:Envelope>